app/Controllers/Api/Pelicula.php

    public function paginado_full() {
        $peliculas = $this->model
        ->when($this->request->getGet('buscar'), static function ($query, $buscar) {
            $query->groupStart()->orLike('peliculas.titulo', $buscar, 'both');
            $query->orLike('peliculas.descripcion', $buscar, 'both')->groupEnd();
        })
        ->when($this->request->getGet('categoria_fk'), static function ($query, $categoriaFK) {
            $query->where('peliculas.categoria_fk', $categoriaFK);
        })
        ->when($this->request->getGet('etiqueta_fk'), static function ($query, $etiquetaFk) {
            $query->where('etiquetas.id', $etiquetaFk);
        })
        ->select('peliculas.*, categorias.titulo as categoria, GROUP_CONCAT(DISTINCT(etiquetas.titulo)) as etiqueta, MAX(imagenes.imagen) as imagen')
        ->join('categorias', 'categorias.id = peliculas.categoria_fk')
        ->join('pelicula_imagen', 'pelicula_imagen.pelicula_fk = peliculas.id','left')
        ->join('imagenes', 'imagenes.id = pelicula_imagen.imagen_fk','left')
        ->join('pelicula_etiqueta', 'pelicula_etiqueta.pelicula_fk = peliculas.id','left')
        ->join('etiquetas', 'etiquetas.id = pelicula_etiqueta.etiqueta_fk','left');


        $peliculas =  $peliculas->groupBy('peliculas.id');
        $peliculas = $peliculas->paginate();
---
SELECT *
FROM `peliculas`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `peliculas`.*, `categorias`.`titulo` as `categoria`, GROUP_CONCAT(DISTINCT(etiquetas.titulo)) as etiqueta, MAX(imagenes.imagen) as imagen
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_fk`
LEFT JOIN `pelicula_imagen` ON `pelicula_imagen`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `imagenes` ON `imagenes`.`id` = `pelicula_imagen`.`imagen_fk`
LEFT JOIN `pelicula_etiqueta` ON `pelicula_etiqueta`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `etiquetas` ON `etiquetas`.`id` = `pelicula_etiqueta`.`etiqueta_fk`
GROUP BY `peliculas`.`id`
) CI_count_all_results
SELECT `peliculas`.*, `categorias`.`titulo` as `categoria`, GROUP_CONCAT(DISTINCT(etiquetas.titulo)) as etiqueta, MAX(imagenes.imagen) as imagen
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_fk`
LEFT JOIN `pelicula_imagen` ON `pelicula_imagen`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `imagenes` ON `imagenes`.`id` = `pelicula_imagen`.`imagen_fk`
LEFT JOIN `pelicula_etiqueta` ON `pelicula_etiqueta`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `etiquetas` ON `etiquetas`.`id` = `pelicula_etiqueta`.`etiqueta_fk`
GROUP BY `peliculas`.`id`
 LIMIT 20

    public function index_por_categoria($categoriaFK) {
        $peliculas = $this->model
        ->select('peliculas.*, categorias.titulo as categoria, GROUP_CONCAT(DISTINCT(etiquetas.titulo)) as etiqueta, MAX(imagenes.imagen) as imagen')
        ->join('categorias', 'categorias.id = peliculas.categoria_fk')
        ->join('pelicula_imagen', 'pelicula_imagen.pelicula_fk = peliculas.id','left')
        ->join('imagenes', 'imagenes.id = pelicula_imagen.imagen_fk','left')
        ->join('pelicula_etiqueta', 'pelicula_etiqueta.pelicula_fk = peliculas.id','left')
        ->join('etiquetas', 'etiquetas.id = pelicula_etiqueta.etiqueta_fk','left')
        ->where('categorias.id', $categoriaFK)
        ->groupBy('peliculas.id')->paginate();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `peliculas`.*, `categorias`.`titulo` as `categoria`, GROUP_CONCAT(DISTINCT(etiquetas.titulo)) as etiqueta, MAX(imagenes.imagen) as imagen
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_fk`
LEFT JOIN `pelicula_imagen` ON `pelicula_imagen`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `imagenes` ON `imagenes`.`id` = `pelicula_imagen`.`imagen_fk`
LEFT JOIN `pelicula_etiqueta` ON `pelicula_etiqueta`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `etiquetas` ON `etiquetas`.`id` = `pelicula_etiqueta`.`etiqueta_fk`
WHERE `categorias`.`id` = '44'
GROUP BY `peliculas`.`id`
) CI_count_all_results
SELECT `peliculas`.*, `categorias`.`titulo` as `categoria`, GROUP_CONCAT(DISTINCT(etiquetas.titulo)) as etiqueta, MAX(imagenes.imagen) as imagen
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_fk`
LEFT JOIN `pelicula_imagen` ON `pelicula_imagen`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `imagenes` ON `imagenes`.`id` = `pelicula_imagen`.`imagen_fk`
LEFT JOIN `pelicula_etiqueta` ON `pelicula_etiqueta`.`pelicula_fk` = `peliculas`.`id`
LEFT JOIN `etiquetas` ON `etiquetas`.`id` = `pelicula_etiqueta`.`etiqueta_fk`
WHERE `categorias`.`id` = '44'
GROUP BY `peliculas`.`id`
 LIMIT 20

    public function show($id = null) {
        $data = [
            'pelicula' => $this->model->select('peliculas.*, categorias.titulo as categoria')->join('categorias', 'categorias.id = peliculas.categoria_fk')->find($id),
            'imagenes' => $this->model->getImagenesById($id),
            'etiquetas' => $this->model->getEtiquetasById($id),
        ];
---
SELECT `peliculas`.*, `categorias`.`titulo` as `categoria`
FROM `peliculas`
JOIN `categorias` ON `categorias`.`id` = `peliculas`.`categoria_fk`
WHERE `peliculas`.`id` = 'etiqueta'

    public function etiquetas_post($id) {
        $peliculaEtiquetaModel = new PeliculaEtiquetaModel();
        $etiquetaFk = $this->request->getPost('etiqueta_fk');
        $peliculaFk = $id;

        $peliculaEtiqueta = $peliculaEtiquetaModel->where('etiqueta_fk', $etiquetaFk)->where('pelicula_fk', $peliculaFk)->first();

        if (!$peliculaEtiqueta) {
            $peliculaEtiquetaModel->insert([
                'pelicula_fk' => $peliculaFk,
                'etiqueta_fk' => $etiquetaFk,

            ]);
---
SELECT *
FROM `pelicula_etiqueta`
WHERE `etiqueta_fk` = '22'
AND `pelicula_fk` = '43'
 LIMIT 1
INSERT INTO `pelicula_etiqueta` (`pelicula_fk`, `etiqueta_fk`) VALUES ('43', '22')