app/Controllers/Dashboard/Categoria.php

SELECT *
FROM `categorias`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `categorias`
---
    public function index()
    {
        // session()->set('key', 4);
        $categoriaModel = new CategoriaModel();

       echo view('dashboard/categoria/index', [
        'categorias' => $categoriaModel->paginate(10),
            'pager' => $categoriaModel->pager
        // ->findAll(),
       ]);