app/Controllers/Dashboard/Pelicula.php

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '3'
---
    public function new(){
        //esto funciona, si no se hubiera reutilizado para _form, ya que ahí espera value, pero para crear no llevan los campos value
        // echo view('pelicula/new');

        //esto funciona si en el modelo el retun es array
        // echo view('dashboard/pelicula/new', [
        //     'pelicula' => [
        //         'titulo' => '',
        //         'descripcion' => ''
        //     ]
        // ]);
        $categoriaModel = new CategoriaModel();


        echo view('dashboard/pelicula/new', [
            'pelicula' => new PeliculaModel(),
            'categorias' => $categoriaModel->find(),
        ]);

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '13'
SELECT *
FROM `categorias`
---
    public function edit($id){
        $peliculaModel = new PeliculaModel();
        $categoriaModel = new CategoriaModel();


        echo view('dashboard/pelicula/edit', [
            'pelicula' => $peliculaModel->find($id),
            'categorias' => $categoriaModel->find(),
        ]);

SELECT *
FROM `etiquetas`
WHERE `categoria_fk` = '43'
SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '9'
SELECT *
FROM `categorias`
---
    public function etiquetas($id) {
        $categoriaModel = new CategoriaModel();
        $etiquetaModel = new EtiquetaModel();
        $peliculaModel = new PeliculaModel();

        $etiquetas = [];

        if ($this->request->getGet('categoria_fk')) {
            $etiquetas = $etiquetaModel
            ->where('categoria_fk', $this->request->getGet('categoria_fk'))
            ->findAll();
        }

        echo view('dashboard/pelicula/etiquetas',[
            'peliculas' => $peliculaModel->find($id),
            'categorias' => $categoriaModel->findAll(),
            'categoria_fk' =>$this->request->getGet('categoria_fk'),
            'etiquetas' => $etiquetas,
        ]);

SELECT *
FROM `pelicula_etiqueta`
WHERE `etiqueta_fk` = '127'
AND `pelicula_fk` = '9'
 LIMIT 1
INSERT INTO `pelicula_etiqueta` (`pelicula_fk`, `etiqueta_fk`) VALUES ('9', '127')
---
    public function etiquetas_post($id) {
        $peliculaEtiquetaModel = new PeliculaEtiquetaModel();
        $etiquetaFk = $this->request->getPost('etiqueta_fk');
        $peliculaFk = $id;

        $peliculaEtiqueta = $peliculaEtiquetaModel->where('etiqueta_fk', $etiquetaFk)->where('pelicula_fk', $peliculaFk)->first();

        if (!$peliculaEtiqueta) {
            $peliculaEtiquetaModel->insert([
                'pelicula_fk' => $peliculaFk,
                'etiqueta_fk' => $etiquetaFk,

            ]);

INSERT INTO `pelicula_imagen` (`imagen_fk`, `pelicula_fk`) VALUES (17, '13')
---
                    ]);

                    $imagenModel = new PeliculaImagenModel();
                    $imagenModel->insert([
                    'imagen_fk' => $imagenId,
                    'pelicula_fk' => $peliculaFk,
                    ]);