app/Controllers/Dashboard/Pelicula.php

    public function index()
    {
        $peliculaModel = new PeliculaModel();

       echo view('dashboard/pelicula/index', [
        'peliculas' => $peliculaModel->findAll(),
       ]);
---
SELECT *
FROM `peliculas`

    public function show($id){
        $peliculaModel = new PeliculaModel();
        // var_dump($peliculaModel->find($id));
        echo view('dashboard/pelicula/show', [
            'pelicula' => $peliculaModel->find($id)
        ]);
---
SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '7'

    public function create(){
        $peliculaModel = new PeliculaModel();

        if ($this->validate('peliculasVal')) {
            $peliculaModel->insert([
                'titulo' => $this->request->getPost('titulo'),
                'descripcion' => $this->request->getPost('descripcion')
            ]);
---
INSERT INTO `peliculas` (`titulo`, `descripcion`) VALUES ('xdxddx', 'xdddd')