app/Controllers/Categoria.php

    public function edit($id){
        $categoriaModel = new CategoriaModel();
        echo view('categoria/edit', [
            'categoria' => $categoriaModel->find($id)
        ]);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '1'