app/Controllers/Pelicula.php

    public function index()
    {
        $peliculaModel = new PeliculaModel();

       echo view('pelicula/index', [
        'peliculas' => $peliculaModel->findAll(),
       ]);
---
SELECT *
FROM `peliculas`

    public function show($id){
        $peliculaModel = new PeliculaModel();
        // var_dump($peliculaModel->find($id));
        echo view('/pelicula/show', [
            'pelicula' => $peliculaModel->find($id)
        ]);
---
SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '1'