app/Models/PeliculaModel.php

    public function getImagenesById($id){
        return $this->select("i.*")
        ->join('pelicula_imagen as pi', 'pi.pelicula_fk = peliculas.id')
        ->join('imagenes as i', 'i.id = pi.imagen_fk')
        ->where('peliculas.id', $id)->findAll();
---
SELECT `i`.*
FROM `peliculas`
JOIN `pelicula_imagen` as `pi` ON `pi`.`pelicula_fk` = `peliculas`.`id`
JOIN `imagenes` as `i` ON `i`.`id` = `pi`.`imagen_fk`
WHERE `peliculas`.`id` = 'etiqueta'

    public function getEtiquetasById ($id){
        return $this->select('e.*')
        ->join('pelicula_etiqueta as pe', 'pe.pelicula_fk = peliculas.id')
        ->join('etiquetas as e', 'e.id = pe.etiqueta_fk')
        ->where('peliculas.id', $id)
        ->findAll();
---
SELECT `e`.*
FROM `peliculas`
JOIN `pelicula_etiqueta` as `pe` ON `pe`.`pelicula_fk` = `peliculas`.`id`
JOIN `etiquetas` as `e` ON `e`.`id` = `pe`.`etiqueta_fk`
WHERE `peliculas`.`id` = 'etiqueta'